{
  "slug": "crypto-market-section",
  "name": "Crypto Market Sections",
  "nameJa": "セクション別暗号資産市場",
  "tagline": "Compare crypto sector performance across 4 timeframes in USD/JPY instantly",
  "taglineJa": "暗号資産の分野別成績を4期間×USD/JPY切替で一画面で比較",
  "description": "A market analysis platform that breaks down cryptocurrency markets by sector. Instantly compare performance metrics (24h, 7d, 30d, 1y) in USD or JPY. Each sector uses market-cap weighted averaging with contributor analysis showing the top coins driving gains or losses.",
  "descriptionJa": "暗号資産市場を約20のセクションに分けて、4つの期間（24時間・7日・30日・1年）の上昇・下落をUSD/JPYで比較できるサイト。時価総額加重平均で集計し、各セクターの変動要因となった銘柄（寄与度）をTOP10で表示します。",
  "category": "crypto",
  "tags": ["crypto", "market-analysis", "sectors", "dashboard", "defi", "nft"],
  "targetAudience": ["短期〜中期の暗号資産投資家", "セクター分析を行うアナリスト", "ポートフォリオ分散を重視する投資家"],
  "status": "development",
  "techStack": ["Next.js", "React", "TypeScript", "Prisma", "PostgreSQL", "TailwindCSS"],
  "platforms": ["web"],
  "features": [
    {
      "title": "Multi-timeframe Sector Comparison",
      "titleJa": "複数期間のセクション比較",
      "description": "Compare 20+ cryptocurrency sectors across 4 timeframes (24h, 7d, 30d, 1y) with market-cap weighted performance in a single table",
      "descriptionJa": "約20のセクションの成績を24時間・7日・30日・1年で一覧比較。時価総額加重平均で統計的正確性を保証"
    },
    {
      "title": "Currency Toggle (USD/JPY)",
      "titleJa": "通貨切替機能（USD/JPY）",
      "description": "Switch between USD and JPY denominated returns. JPY includes real-time FX impact for true yen-based analysis",
      "descriptionJa": "USDとJPYを即座に切替。JPYは為替変動込みの正確な円建て成績を表示"
    },
    {
      "title": "Contributor Analysis",
      "titleJa": "寄与度分析",
      "description": "Drill into any sector to see top 10 coins driving gains and top 10 driving losses with weight, change %, and contribution metrics",
      "descriptionJa": "セクター詳細で上昇・下落の原因銘柄TOP10を表示。各銘柄の重み、変化率、セクター内寄与を確認"
    },
    {
      "title": "Flexible Filtering & Sorting",
      "titleJa": "フィルタリング・ソート",
      "description": "Filter by market cap, coin count, volume. Sort by any metric. Re-aggregation from coin-level data ensures accuracy",
      "descriptionJa": "時価総額・銘柄数・出来高でフィルタリング。任意指標でソート。銘柄レベルの再集計で正確性を保証"
    },
    {
      "title": "Real-time Data Refresh",
      "titleJa": "リアルタイムデータ更新",
      "description": "15-minute auto-refresh from CoinGecko API with manual refresh option. Latest timestamp always visible",
      "descriptionJa": "CoinGecko APIから15分ごとの自動更新。手動更新ボタンで即座にデータ同期可能"
    },
    {
      "title": "Detailed Sector Breakdown",
      "titleJa": "セクター詳細表示",
      "description": "View market cap, volume, period performance cards, and complete constituent coin list ranked by market cap",
      "descriptionJa": "セクター詳細ページで時価総額・出来高・期間別成績サマリ・寄与度・代表銘柄リストを表示"
    }
  ],
  "userProblem": "Crypto investors lack a unified dashboard to compare sector-wide performance across multiple timeframes. Existing tools focus on individual coins, requiring manual aggregation to understand which sector is driving market moves.",
  "userProblemJa": "暗号資産投資家は複数期間にわたってセクター全体のパフォーマンスを一度に比較するダッシュボードを持っていません。既存ツールは個別銘柄に焦点を当てているため、どの分野に資金が集まっているかを把握するには手作業の集計が必要です。",
  "solution": "Crypto Market Sections provides a centralized platform with sector-level returns (24h/7d/30d/1y) in USD/JPY. Market-cap weighted aggregation ensures accuracy, contributor display reveals which coins drive each sector's performance, and filtering enables customized analysis to spot sector rotation opportunities.",
  "solutionJa": "セクター単位の成績（24h/7d/30d/1y）をUSD/JPYで即座に確認できる一元管理プラットフォーム。時価総額加重で正確性を保証し、寄与度表示で各セクターを動かす銘柄が一目瞭然。フィルタリングでセクターローテーション機会を即座に発見。",
  "callToAction": "サイトを見る",
  "promotionKeywords": ["暗号資産セクター分析", "ビットコインアルトコイン比較", "仮想通貨市場トレンド", "DeFi NFT パフォーマンス", "円建て暗号資産", "リアルタイムダッシュボード", "セクターローテーション", "時価総額加重", "投資判断", "CoinGecko", "市場分析ツール", "分野別パフォーマンス"],
  "createdAt": "2026-02-14",
  "updatedAt": "2026-02-22",
  "order": 3,
  "featured": false,
  "autoPromote": true
}
